
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ПустаяСтрока(Пароль) Тогда
		Отказ=Истина;
		Менеджер = РТЗ_НайтиКлиентаПоПаролю(Пароль);
		Закрыть(Менеджер);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово()	
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РТЗ_НайтиКлиентаПоПаролю(_Пароль="")
	Если ПустаяСтрока(_Пароль) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	_Пользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого _Пользователь Из _Пользователи Цикл
		Если ПолучитьХешПароля(_Пароль) = _Пользователь.СохраняемоеЗначениеПароля Тогда
			Возврат Новый СправочникСсылкаИмяСправочника(_Пользователь.УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьХешПароля(_Пароль="")
	ХешированныеДанные = Новый ХешированиеДанных(ХешФункция.SHA1);
	ХешированныеДанные.Добавить(Base64Значение(_Пароль));
	Возврат ХешированныеДанные.ХешСумма;
КонецФункции

#КонецОбласти
