
#Область ПрограммныйИнтерфейс

#Если Клиент Тогда

// Вывести пользователю заказ клиент.
// 
// Параметры:
//  Заказ  - ДокументСсылка.РТЗ_РозничныйЗаказ
//  Параметры - Неопределено - Параметры
Процедура ВывестиПользователюЗаказКлиент(Заказ, Параметры = Неопределено) Экспорт
	
	Если Заказ = ПредопределенноеЗначение("Документ.РТЗ_РозничныйЗаказ.ПустаяСсылка") Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеТабличногоДокумента = "Заказ_" + ПолучитьСформированнуюСтрокуСДатойСеансом();
	
	ТабличныйДокумент = РТЗ_ПечатьЗаказаВызовСервера.ПолучитьТабличныйДокументСервер(Заказ);
	Если Не ЗначениеЗаполнено(Параметры) Тогда
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ОтображатьСетку = Ложь;		
		ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
		ТабличныйДокумент.ОтображатьГруппировки = Ложь;
		
		ТабличныйДокумент.Показать(НаименованиеТабличногоДокумента, "", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Клиент Или Сервер Тогда
	
// Получить сформированную строку с датой сеансом.
// 
// Возвращаемое значение:
//  Строка - Получить сформированную строку с датой сеансом
Функция ПолучитьСформированнуюСтрокуСДатойСеансом()
	
	Результат = Строка(ОбщегоНазначенияКлиент.ДатаСеанса());
	
	МассивСимволов = Новый Массив(" ", ".", "-");
	Для Каждого СимволЗамены Из МассивСимволов Цикл
		Результат = СтрЗаменить(Результат, СимволЗамены, "_");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

#КонецОбласти