
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЭтотПользовательОбладаетПривилегированнымРежимом() Тогда
		Элементы.Печать.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать()
	
	//@skip-check use-non-recommended-method
	ПолучитьТабличныйДокументОтСервера(Объект.Ссылка)
		.Показать("Заказ_"+ТекущаяДата());
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтотПользовательОбладаетПривилегированнымРежимом()
	
	Возврат ПривилегированныйРежим();
	
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументОтСервера(ДокументЗаказа)
	
	Возврат ДокументЗаказа.ПолучитьОбъект().ПечататьЗаказСервер();

КонецФункции

#КонецОбласти