
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтотПользовательЯвляетсяТерминалом() Тогда
		Элементы.Печать.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать()
	
	//@skip-check use-non-recommended-method
	ПолучитьТабличныйДокументОтСервера(Объект.Ссылка)
		.Показать("Заказ_"+ТекущаяДата());
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтотПользовательЯвляетсяТерминалом()
	
	Возврат РольДоступна("РТЗ_БазовыеПраваТорговыйЗал");
	
КонецФункции

&НаСервере
Функция ПолучитьТабличныйДокументОтСервера(ДокументЗаказа)
	
	Возврат ДокументЗаказа.ПолучитьОбъект().ПолучитьТабличныйДокументаЗаказа();

КонецФункции

#КонецОбласти