
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура РТЗ_ПриОткрытииПосле(Отказ)
	
	РТЗ_ИзменитьДоступностьНеПропускатьПриФормированииНакладныхНаКлиенте(Объект.РТЗ_ЭтоТорговыйЗал);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РТЗ_ЭтоТорговыйЗалПриИзмененииПосле(Элемент)
	
	РТЗ_ИзменитьДоступностьНеПропускатьПриФормированииНакладныхНаКлиенте(Объект.РТЗ_ЭтоТорговыйЗал);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменить доступность не пропускать при формировании накладных на клиенте.
// Параметры:
//  Параметр - Булево
&НаКлиенте
Процедура РТЗ_ИзменитьДоступностьНеПропускатьПриФормированииНакладныхНаКлиенте(Параметр)
	
	Элементы.РТЗ_НеПропускатьПриФормированииНакладных.Доступность = Параметр;
	
КонецПроцедуры

#КонецОбласти

