
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура РТЗ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Todo
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РТЗ_ОКВместо(Команда)
	
	ОчиститьСообщения();
	РТЗ_Отказ = Ложь;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Если СтрокаТовары.Подобрано > СтрокаТовары.ВНаличии Тогда
			РТЗ_Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если РТЗ_Отказ Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Подобрано не может превышать текущую доступность на складе");
		Возврат;
	Иначе	
		ПродолжитьВызов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
