
#Область ОписаниеПеременных

&НаКлиенте
Перем СкрыватьНастройкуПодбора;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура РТЗ_ПриОткрытииПосле(Отказ)
	
	Параметры.Свойство("СкрыватьНастройкуПодбора", СкрыватьНастройкуПодбора);
	
	Если ТипЗнч(СкрыватьНастройкуПодбора) = Тип("Булево") Тогда
		Если СкрыватьНастройкуПодбора Тогда
			Элементы.ФормаГруппаНастройки.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область Инициализация

СкрыватьНастройкуПодбора = Неопределено;

#КонецОбласти
