
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура РТЗ_ПриОткрытииПосле(Отказ)
	//Пока пустой
КонецПроцедуры

&НаСервере
Процедура РТЗ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СкрыватьНастройкуПодбора = Истина Тогда	
		РТЗ_УстановитьЗначениеИДоступностьТолькоВНаличии(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Установить значение и доступность только в наличии.
// 
// Параметры:
//  Параметр - Булево
&НаСервере
Процедура РТЗ_УстановитьЗначениеИДоступностьТолькоВНаличии(Параметр)
	
	ТолькоВНаличии = Параметр;
	Элементы.ТолькоВНаличии.Доступность = Не Параметр;
	Элементы.ФормаГруппаНастройки.Видимость = Не Параметр;
	
КонецПроцедуры

#КонецОбласти