// @strict-types

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать()
	Если Корзина.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВводаПароля", ЭтотОбъект);
	ОткрытьФорму("Обработка.РТЗ_РаботаТорговогоЗала.Форма.ВводПароля",,,,,, 
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодборНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

// Обработка оповещения
// Параметры:
//  Результат - СправочникСсылка.Пользователи
//	ДопПараметры - Неопределено
&НаКлиенте
Процедура ПослеЗакрытияВводаПароля(Результат, ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	//Формируем на сервере
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти
