// @strict-types

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать()
	Если
	
	
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодборНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


#КонецОбласти
