#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбщегоНазначенияКлиент.СообщитьПользователю("Оповещение: " + ИмяСобытия);
	//ОбработкаОповещенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Если Не УспешноЗаполнитьНастройкамиТемриналаИВернутьСтатус() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка при заполнении настроек, обратитесь в IT-отдел!");
		Отказ = Истина;
	КонецЕсли;
	
	АвтоЗаголовок = Ложь;
	Заголовок = ("Рабочее место менеджера торгового зала / " + "Терминал: <" + ПолучитьНаименоваиеТекущегоТерминала() + ">");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьВозврат(Команда)
	ОформитьВозвратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать()
	Если Объект.Корзина.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВводаПароля", ЭтотОбъект);
	ОткрытьФорму("Документ.РТЗ_РозничныйЗаказ.Форма.ВводПароля",,,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Подбор()
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", 
				 ЗаполнитьПараметрыПодбораНаСервере(),
				 ЭтотОбъект, 
				 УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьПараметрыПодбораНаСервере()
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в розничный заказ'");
	
	Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Дата", 										Дата);
	ПараметрыФормы.Вставить("Валюта", 										Валюта);
	ПараметрыФормы.Вставить("ВидЦены", 										ВидЦены);
	ПараметрыФормы.Вставить("Документ", 									Объект.Ссылка);
	ПараметрыФормы.Вставить("Заголовок", 									ПараметрЗаголовок);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", 								ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("ЗапрашиватьКоличество", 						Истина);
	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",							Истина);
	ПараметрыФормы.Вставить("ЗапрашиватьКоличество", 						Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены", 						Истина);
	ПараметрыФормы.Вставить("СкрыватьНастройкуПодбора", 					Истина);
	ПараметрыФормы.Вставить("ВозвращатьМногооборотнуюТару", 				Истина);
	ПараметрыФормы.Вставить("СкрыватьКнопкуЗапрашиватьКоличество", 			Истина);

	ПараметрыФормы.Вставить("ОграничиватьВариантыОбеспечения", 				Истина);

	ПараметрыФормы.Вставить("РежимПодбораБезСоглашенийСКлиентами ", 		Истина);

	ПараметрыФормы.Вставить("РежимПодбораИсключитьГруппыДоступныеВЗаказах", Ложь);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти",Истина);
	
	//Группу складов и розничное налогооблажение берем из константы
	ПараметрыФормы.Вставить("Склад", 				Константы.РТЗ_ГруппаСкладовПредприятия.Получить());
	ПараметрыФормы.Вставить("НалогообложениеНДС", 	Константы.РТЗ_ТерминалНалогооблажениеНДС.Получить());
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияПодбора(Результат, ДопПараметры) Экспорт
	//TODO: реалзовать подбор
КонецПроцедуры

&НаСервере
Функция УспешноЗаполнитьНастройкамиТемриналаИВернутьСтатус()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЦен.Ссылка,
		|	ВидыЦен.ВалютаЦены.Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВидЦены = ВыборкаДетальныеЗаписи.Ссылка;
			ЦенаВключаетНДС = ВидЦены.ПолучитьОбъект().ЦенаВключаетНДС;
			Валюта = ВидЦены.ПолучитьОбъект().ВалютаЦены.ПолучитьОбъект().Ссылка;
	КонецЦикла;

	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОформитьВозвратНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

// Возвращает имя текущего пользоватя
// Возвращаемое значение:
//  - Строка
&НаСервере
Функция ПолучитьНаименоваиеТекущегоТерминала()
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	
КонецФункции

//Вызывается в случае успешных проверок и нахождения менеджера
// Параметры:
//  Менеджер - СправочникСсылка.Пользователи - ссылка на справочник пользователи
// Возвращаемое значение:
//  - ТабличныйДокумент
&НаСервере
Функция СформироватьНаСервере(Менеджер)
	
	ДокументЗаказа = Документы.РТЗ_РозничныйЗаказ.СоздатьДокумент();
	ДокументЗаказа.Менеджер = Менеджер;
	ДокументЗаказа.Корзина.Загрузить(Объект.Корзина.Выгрузить());
	ДокументЗаказа.ВидЦены = Объект.ВидЦены;
	ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	Возврат ДокументЗаказа.ПечататьЗаказСервер();
	
КонецФункции

// Обработка оповещения
// Параметры:
//  ПользовательСсылка - СправочникСсылка.Пользователи - Ссылка на менеджера
//  ДопПараметры - Неопределено
&НаКлиенте
Процедура ПослеЗакрытияВводаПароля(ПользовательСсылка, ДопПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере(ПользовательСсылка).Показать("Заказ_"+ОбщегоНазначенияКлиент.ДатаСеанса());
	
	Объект.Корзина.Очистить();
	
КонецПроцедуры

#КонецОбласти
