#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АвтоЗаголовок = Ложь;
	Заголовок = ("Рабочее место менеджера торгового зала / " + "Терминал: <" + ПолучитьНаименоваиеТекущегоТерминала() + ">");
	
	//Параметры при открытии, получаются разрешенные
	ПараметрыТерминала = ПолучитьПараметрыТорговогоТерминала();
	
	Объект.Склад = ПараметрыТерминала.Склад;
	Объект.ВидЦены = ПараметрыТерминала.ВидЦены;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция ПолучитьПараметрыТорговогоТерминала()
	
	
	
	Возврат Новый Структура;
КонецФункции

&НаКлиенте
Процедура ОформитьВозврат(Команда)
	ОформитьВозвратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать()
	Если Объект.Корзина.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВводаПароля", ЭтотОбъект);
	ОткрытьФорму("Документ.РТЗ_РозничныйЗаказ.Форма.ВводПароля",,,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Подбор()
	Параметры = ПолучитьПараметрыПодбора();
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.Форма", Параметры, ЭтотОбъект,,,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОформитьВозвратНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

// Возвращает имя текущего пользоватя
// Возвращаемое значение:
//  - Строка
&НаСервере
Функция ПолучитьНаименоваиеТекущегоТерминала()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
КонецФункции

//Формирует параметры формы подбора
//
// Возвращаемое значение:
//  - Структура
&НаСервере
Функция ПолучитьПараметрыПодбора()
	Параметры = Новый Структура;
	Возврат Параметры;
КонецФункции

//Вызывается в случае успешных проверок и нахождения менеджера
// Параметры:
//  Менеджер - СправочникСсылка.Пользователи - ссылка на справочник пользователи
// Возвращаемое значение:
//  - ТабличныйДокумент
&НаСервере
Функция СформироватьНаСервере(Менеджер)	
	ДокументЗаказа = Документы.РТЗ_РозничныйЗаказ.СоздатьДокумент();
	ДокументЗаказа.Менеджер = Менеджер;
	ДокументЗаказа.Корзина.Загрузить(Объект.Корзина.Выгрузить());
	ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	Возврат ДокументЗаказа.ПечататьЗаказСервер();
КонецФункции

// Обработка оповещения
// Параметры:
//  ПользовательСсылка - СправочникСсылка.Пользователи - Ссылка на менеджера
//  ДопПараметры - Неопределено
&НаКлиенте
Процедура ПослеЗакрытияВводаПароля(ПользовательСсылка, ДопПараметры = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check use-non-recommended-method
	СформироватьНаСервере(ПользовательСсылка)
		.Показать("Заказ_"+ТекущаяДата());
	Объект.Корзина.Очистить();
КонецПроцедуры

#КонецОбласти
