#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//todo
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать()
	Если Объект.Корзина.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВводаПароля", ЭтотОбъект);
	ОткрытьФорму("Документ.РТЗ_РозничныйЗаказ.Форма.ВводПароля",,,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Подбор()
	ПодборНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодборНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

//Вызывается в случае успешных проверок и нахождения менеджера
// Параметры:
//  Менеджер - СправочникСсылка.Пользователи - ссылка на справочник пользователи
// Возвращаемое значение:
//  - ТабличныйДокумент
&НаСервере
Функция СформироватьНаСервере(Менеджер)	
	ДокументЗаказа = Документы.РТЗ_РозничныйЗаказ.СоздатьДокумент();
	ДокументЗаказа.Менеджер = Менеджер;
	ДокументЗаказа.Корзина.Загрузить(Объект.Корзина.Выгрузить());
	ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	Возврат ДокументЗаказа.ПечататьЗаказСервер();
КонецФункции

// Обработка оповещения
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Ссылка на менеджера
//	ДопПараметры - Неопределено - допольнительные параметры, обычно массив
&НаКлиенте
Процедура ПослеЗакрытияВводаПароля(Пользователь, ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		//Пользователь не найден
		Возврат;
	КонецЕсли;
	
	//@skip-check use-non-recommended-method
	СформироватьНаСервере(Пользователь)
		.Показать("Заказ_"+ТекущаяДата());
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ОбработчикиСобытийЭлементовТаблицыФормыКорзина

&НаКлиенте
Процедура КорзинаПриИзменении(Элемент)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Цена) И ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
		Элемент.ТекущиеДанные.Сумма = Элемент.ТекущиеДанные.Количество * Элемент.ТекущиеДанные.Цена;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
