#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АвтоЗаголовок = Ложь;
	ДоступныеСклады.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Склады");
	
	ЗаполнитьНастройкамиТемринала();
	Заголовок = ("Рабочее место менеджера торгового зала / " + "Терминал: <" + ПолучитьНаименоваиеТекущегоТерминала() + ">");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьВозврат(Команда)
	ОформитьВозвратНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать()
	Если Объект.Корзина.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВводаПароля", ЭтотОбъект);
	ОткрытьФорму("Документ.РТЗ_РозничныйЗаказ.Форма.ВводПароля",,,,,,
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Подбор()
	ПараметрыПодбора = Новый Структура;
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.Форма", ПараметрыПодбора, ЭтотОбъект,,,,
	Новый ОписаниеОповещения("ПослеЗакрытияПодбора", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияПодбора(Результат, ДопПараметры) Экспорт
	//TODO: реалзовать подбор
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкамиТемринала()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РТЗ_НастрокиРабочегоМеста.Настройки,
		|	РТЗ_НастрокиРабочегоМеста.Терминал
		|ИЗ
		|	РегистрСведений.РТЗ_НастрокиРабочегоМеста КАК РТЗ_НастрокиРабочегоМеста
		|ГДЕ
		|	РТЗ_НастрокиРабочегоМеста.Терминал = &Терминал";
	
	Запрос.УстановитьПараметр("Терминал", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Настройки = ВыборкаДетальныеЗаписи.Настройки.ПолучитьОбъект();
		ВидЦеныТерминала = Настройки.ВидЦены;
		ДоступныеСклады.ЗагрузитьЗначения(Настройки.ДоступныеСклады.ВыгрузитьКолонку("Склад"));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОформитьВозвратНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

// Возвращает имя текущего пользоватя
// Возвращаемое значение:
//  - Строка
&НаСервере
Функция ПолучитьНаименоваиеТекущегоТерминала()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
КонецФункции

//Вызывается в случае успешных проверок и нахождения менеджера
// Параметры:
//  Менеджер - СправочникСсылка.Пользователи - ссылка на справочник пользователи
// Возвращаемое значение:
//  - ТабличныйДокумент
&НаСервере
Функция СформироватьНаСервере(Менеджер)	
	ДокументЗаказа = Документы.РТЗ_РозничныйЗаказ.СоздатьДокумент();
	ДокументЗаказа.Менеджер = Менеджер;
	ДокументЗаказа.Корзина.Загрузить(Объект.Корзина.Выгрузить());
	ДокументЗаказа.ВидЦены = ВидЦеныТерминала;
	ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	Возврат ДокументЗаказа.ПечататьЗаказСервер();
КонецФункции

// Обработка оповещения
// Параметры:
//  ПользовательСсылка - СправочникСсылка.Пользователи - Ссылка на менеджера
//  ДопПараметры - Неопределено
&НаКлиенте
Процедура ПослеЗакрытияВводаПароля(ПользовательСсылка, ДопПараметры = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check use-non-recommended-method
	СформироватьНаСервере(ПользовательСсылка)
		.Показать("Заказ_"+ТекущаяДата());
	Объект.Корзина.Очистить();
КонецПроцедуры

#КонецОбласти
